#+TITLE:       visualizando dos años de orgmode con gnuplot - viewing two years of orgmode with gnuplot
#+AUTHOR:      Osiris Alejandro Gómez
#+EMAIL:       osiux@osiux.com
#+LANGUAGE:    es
#+LINK_HOME:   index.html
#+INCLUDE: "header.org"
#+DATE:        2011-12-29

** Introducción

Desde que comencé a usar org-mode [fn:orgmode] siempre tuve ganas de
graficar el registro de horas que llevo a diario, pasaron dos largos
años y hoy lo conseguí, luego de 9 horas y 59 minutos:

#+BEGIN_EXAMPLE
 ** tareas por día.........................................** 9:59
    :LOGBOOK:
    CLOCK: [2011-12-29 jue 00:04]--[2011-12-29 jue 02:45] =>  2:41
    CLOCK: [2011-12-28 mié 11:50]--[2011-12-28 mié 13:27] =>  1:37
    CLOCK: [2011-12-26 lun 16:50]--[2011-12-26 lun 19:00] =>  2:10
    CLOCK: [2011-12-16 vie 10:24]--[2011-12-16 vie 13:55] =>  3:31
    :END:
#+END_EXAMPLE

Entonces quiero compartir el proceso de esta mini aventura,
especialmente para todos aquellos que no conocen nada acerca de
org-mode y tienen ganas de saber qué es y par qué sirve.

Es difícil de sintetizar, lo podés usar como anotador, también como
agenda, llevar el registro de horas de un proyecto (o varios), hacer
planillas de cáculo y hasta ejecutar código de distintos lenguajes de
programación entre muchas otras cosas interesantes, casi todo se puede
hacer en org-mode.

Lo interesante es que el formato de archivos usados por orgmode son
simples archivos de texto plano, con esto está garantizada la
compatibiliad y portabilidad de todos tus datos, los podés leer desde
cualquier sistema operativo y con cualquier editor de texto,
obviamente la edición se agiliza muchísimo usando org-mode.

Un detalle, org-mode es parte de Emacs [fn:emacs], pero no hay que
tener miedo, lleva un poco de tiempo aprenderlo y vale la pena.

** Cronometrar Tareas

Para iniciar el reloj de una tarea basta con presionar =C-c C-x C-i=,
es decir =Ctrl+C Ctrl+x Ctrl+i= sobre una tarea, y qué es una tarea,
básicamente una línea que comience con asteriscos:

#+BEGIN_EXAMPLE
  * tareas
  ** primer tarea
  ** segunda tarea
#+END_EXAMPLE

Se pueden definir atajos de teclado en el archivo =.emacs=, en mi
caso alcanza con presionar =f9 i= para comenzar y luego =f9 o=
para finalizar:

#+BEGIN_SRC emacs-lisp :exports code
  (global-set-key (kbd "<f9> i") 'org-clock-in)
  (global-set-key (kbd "<f9> j") 'org-clock-jump-to-current-clock)
  (global-set-key (kbd "<f9> o") 'org-clock-out)
#+END_SRC

Cada vez que se utiliza el reloj se crea una línea que indica la fecha
y hora de comienzo y fin de la tarea y luego la cuenta de las horas y
minutos transcurridos en ese periódo de tiempo:

#+BEGIN_SRC org :exports code
    CLOCK: [2011-12-29 jue 00:04]--[2011-12-29 jue 02:45] =>  2:41
#+END_SRC

Como se trata solamente de texto, es posible editar el texto
manualmente, lo cual permite mucha flexibilidad, sólo hay que respetar
el formato y cada vez que se presione =C-c C-c= sobre la línea, la
cantidad de horas se recalcula. Además se pueden usar las flechas para
avanzar/retrocer días y horas respetando el calendario.

Eso es todo, solo hay que acordarse de iniciar y detener el reloj cada
vez que se está trabajando en una tarea en particular, aunque se puede
registar más tarde editando los valores manualmente.

Sugiero agregar un par de líneas al =.bashrc= que ayudan mucho para
determinar qué estuve haciendo y exáctamente cuándo:

#+BEGIN_SRC sh :exports code
  export HISTSIZE=100000
  export HISTFILESIZE=100000
  export HISTTIMEFORMAT='%Y-%m-%d %H:%M '
  HISTCONTROL=$HISTCONTROL${HISTCONTROL+,}ignoredups
  HISTCONTROL=ignoreboth
  shopt -s histappend
#+END_SRC

Esto cambia la vista del comando =history= y es de gran ayuda:

#+BEGIN_SRC sh :exports code
  > history | tail
   5237  2011-12-29 03:05 cdb
   5240  2011-12-29 03:16 cd
   5241  2011-12-29 03:16 g f9 .emacs
   5242  2011-12-29 03:21 :q
   5243  2011-12-29 03:29 cd
   5245  2011-12-29 03:29 gi hist .bashrc 
   5246  2011-12-29 03:29 history | tail
#+END_SRC

** Conclusión

Org-mode es fiel a la filosofía UNIX al permitir unir muchas pequeñas
herramientas, en este caso: =bash, awk, egrep, sort, gnuplot= con la
ventaja de que no solo no es necesario salir del editor de texto sino
que además se integran perfectamente unas con otras al mantener la
simplicidad de manejar todo en archivos de textos permitiendo que el
límite para obtener algo deseado sea sólo la imaginación de quién lo
usa.

Si llegaste hasta acá te recomiendo leer:

http://osiux.com/emacs-orgmode-organize-your-life-in-plain-text.txt

Por cierto, este artículo lo escribí usando sintaxis
*restructuredtext* [fn:rst] alternando entre =rst-mode= y
=org-mode= dentro de emacs en el mismo archivo donde generé todos
los scripts para graficar org-mode.

Ejecutando unas pocas líneas se puede ver, cuanto tardé:

#+BEGIN_EXAMPLE
  #+begin_src sh :session :results output
  cd ~/org
  grep -A 3 "*** visualizando" plot.org | grep "="
  #+end_src

  #+results:
  :     CLOCK: [2011-12-29 jue 02:55]--[2011-12-29 jue 05:47] =>  2:52
#+END_EXAMPLE

